src/InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПользователей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Установить настройку пользователя.
// 
// Параметры:
//  ЗначениеНастройки  - Произвольный - Значение настройки
//  ИмяНастройки - Строка - Имя настройки
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - Пользователь
Процедура Установить(ЗначениеНастройки, ИмяНастройки, Пользователь = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение = Пользователь;
	НаборЗаписей.Отбор.Настройка.Использование = Истина;
	НаборЗаписей.Отбор.Настройка.Значение = ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки];

	Запись = НаборЗаписей.Добавить();

	Запись.Пользователь = Пользователь;
	Запись.Настройка = ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки];
	Запись.Значение = ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки].ТипЗначения.ПривестиЗначение(
		ЗначениеНастройки);

	НаборЗаписей.Записать();

	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
